/// @file   main.h
/// @date   2019.07.10
/// @author PSM
/// @brief  메인루프 처리 관련 헤더 file

#ifdef MAIN_C
	#define 	EXTERN
	#define 	GLOBAL_VARIABLE_DEFINE
#else
	#define 	EXTERN extern
#endif

/*==============================================================================
 Timer Decrease
 ==============================================================================*/
#define	TDEC_1ms_MAIN()			{	/*	1ms 타이머 감산			*/	\
								}
#define	TDEC_10ms_MAIN()		{	/*	10ms 타이머 감산		*/	\
									TDEC(gu8_TimerHWWait);		\
								}
#define	TDEC_100ms_MAIN()		{	/*	100ms 타이머 감산		*/	\
								}
#define	TDEC_1s_MAIN()			{	/*	1s 타이머 감산			*/	\
									TDEC(gu32_Timer_Condensation);	\
									TDEC(gu8_TimerHeaterEndurance_Test);	\
									TDEC(gu8_TimerTestColdOff);	\
									TDEC(gu8_TimerTestColdOn);	\
								}
#define	TDEC_10s_MAIN()			{	/*	10s 타이머 감산			*/	\
								}
#define	TDEC_1min_MAIN()		{	/*	1min 타이머 감산		*/	\
									TDEC(gu8_TimerHeaterEndurance_Test_30min);	\
								}
#define	TDEC_10min_MAIN()		{	/*	10min 타이머 감산		*/	\
								}
#define	TDEC_1h_MAIN()			{	/*	1h 타이머 감산			*/	\
								}

/*==============================================================================
 Constant Definition
 ==============================================================================*/
// 프로그램 버전 표시
// 1) 첫번째 자리 : 	1 - 양산 적용
//                  0 - 양산 외
// 2) 두번째 자리 : 	1 - DPP
//                  2 - LPP
//					0 - 양산
// 3) 세번째 자리 : 		미정의
// 4) 네번째 자리 : 버전 표시
//                  0 ~ 16  (16이상이면 0 부터 재시작)
//#define PROGRAM_VERSION_NO      (0x1001)			//	220509 국내향 초도양산
//#define PROGRAM_VERSION_NO      (0x1002)			//@001	220509 국내향 초도양산 전 변경
//#define PROGRAM_VERSION_NO      (0x1002)			//@002	220523 일본향 초도양산 (버전은 1002로 그대로 동일하게, 국내향 공용프로그램으로 자동화검사 버전 동일하게 진행하기 위함)
//#define PROGRAM_VERSION_NO      (0x1003)			//@003
													//@003	양산용 프로그램에 출하용 반복테스트 프로그램 추가
													//@004	45도 히터 잠깐 켜지는거 수정
													//@005	에러29번 온도 상향 80도로 수정
//#define PROGRAM_VERSION_NO      (0x1004)			//@006	국내향 공장검사 추출 2초 리미트 (일본향과 동일하게)
													//@007	국내향 100도 CT센싱 오차로 인하여 목표온도 도달 안할 시, 목표유량 0.01LPM 씩 감소 사양 추가
													//@008	불필요 소스 삭제 및 통일
													//@009	냉각사양 유지모드 팬전압 18V로 변경 (특수모드 설정 급속모드도 18V로 변경)
													//@010	특수모드 TEM전압 상승 +1V로 확정하고 급속모드 외 모드 전체 적용
													//@011	냉각 에코모드 미진입 특수모드 추가
													//@012	전원 인가 시 or 냉수 OFF→ON 시, 냉각 급속/유지모드 진입조건 변경
													//@013	냉각사양 팬 전압 변경에 따른 특수모드 냉수 롱버튼 삭제 및 온수+냉수버튼으로 추가 / 팬전압 하강(급속모드18V) 버튼도 다른 버튼으로 변경
													//@014	냉각 유지모드 구간 : 외기 30도 이상 +3V / 외기 20도 이상 +2V / 이하 유지 // 23~29구간 23~27로 변경
													//@015	특수모드에서 UV정기살균 15분 즉시 동작
													//@016	특수모드 설정 변경 디스플레이 사양 추가
													//@017	유지모드 일 시 냉수온도 3도 미만 감지시 최저전압 동작 사양 추가
//#define PROGRAM_VERSION_NO      (0x1005)			//@018	급속모드 미완료 6시간 타이머 수정
													//@019	예열->추출정지->온수 스텝 2F-> 다시 추출로 갈 경우 음성 안나오는 것 수정
													//@020	@008 삭제 원복
													//@021	(※임시보류) 정유량 캘리브레이션 값 변경 (유량이 적게 나오는 문제. 일본향은 많이나와서 줄임)
													//@022	냉각 PID 특수기능으로 적용
													//@023	파세코 생산을 위한 수동단축검사모드 개선
													//@024	유로모듈 및 필터 탈부착 음성 출력
													//@025	방열판 과열 방지를 위해 방열판 온도로 동작 사양 추가
//#define PROGRAM_VERSION_NO      (0x1006)			//@026	E02에러 삭제 (유량센서 간헐적 마이그레이션으로 이상 파형 약 70~100Hz가 측정되어 E02에러 발생시료 발생)
//#define PROGRAM_VERSION_NO      (0x1006)			//@027	(버전변경 없음)	검사모드 전환 시 미완료 검사항목 7-Seg에 3회 점멸 표시
//#define PROGRAM_VERSION_NO      (0x1007)			//@028	생산기술팀 시간 단축 (추출 검사 제한 1.5초→1초)
													//@029	냉수탱크 향 제거를 위하여 초기플러싱 단계(정/냉) 용량 변경
													//@030	파세코 LPP 이후 공정 검사 완료 조건 강화
//#define PROGRAM_VERSION_NO      (0x1008)			//@031	Wi-Fi 상태정보데이터 불필요 프로토콜 송신 삭제 (FOTA 버전은 V1008로 UP)
													//@032	냉각 PI제어 양산에 적용
//#define PROGRAM_VERSION_NO      (0x1009)			//@033	1. 물맛이슈 대응으로 초기플러싱 단계 냉수탱크 용량 변경 (국내향 선 적용 / 4L -> 5L 변경) / 2. 플러싱중 WIFI 연결 가능하도록 해당 관련 키 동작하도록 수정
#define PROGRAM_VERSION_NO      (0x1001)			//V2 신규 


//★★	FOTA할일 있으면 FOTA버전도 업데이트 해줘야함	★★//
//★★	버전 업데이트하면 설희석 차장님한테 말씀드리기	★★//

#define Z_TimerHWWait	(10)						//	하드웨어 안정화 대기 시간	<100ms/10ms>

/*==============================================================================
 Variable Definition
 ==============================================================================*/
EXTERN U8 gu8_TimerHWWait;							//	하드웨어 안정화 시간	<100ms/100ms>


/*==============================================================================
 function Definition
 ==============================================================================*/
void MainLoop(void);
void RamClear(void);


//=============================================================================
#undef 	EXTERN
#undef 	GLOBAL_VARIABLE_DEFINE
//=============================================================================
